{
  "backend/main.mo": "Motoko canister implementing user profiles, job vacancies, applications, posts, and messages with access control and blob storage, including CRUD, sorting, and authentication checks.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to source files, components, and test IDs with confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Tailwind CSS base configuration defining color variables, themes, and global styling rules including dark mode tokens.",
  "frontend/index.html": "HTML entry point loading the React bundle and mounting the app into the root element.",
  "frontend/src/App.tsx": "Defines the TanStack Router configuration for all public, user, and admin routes and renders the RouterProvider.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "UI screen shown when a user without admin permissions attempts to access restricted pages.",
  "frontend/src/hooks/queries/useAdminMutations.ts": "React Query mutation hooks for creating, updating, and deleting job vacancies and posts through the backend actor.",
  "frontend/src/hooks/queries/useApplications.ts": "React Query hooks for fetching a user's applications and submitting new job applications.",
  "frontend/src/hooks/queries/useCallerRole.ts": "React Query hook that retrieves the caller's role (admin/user/guest) from the backend actor.",
  "frontend/src/hooks/queries/useCallerUserProfile.ts": "Hooks to fetch and save the caller's user profile using react-query and actor API.",
  "frontend/src/hooks/queries/useJobs.ts": "Hooks for listing, searching, and fetching job vacancies via actor-backed queries.",
  "frontend/src/hooks/queries/useMessages.ts": "Messaging hooks to fetch inbox/sent messages and send new messages with cache invalidation.",
  "frontend/src/hooks/queries/usePosts.ts": "Provides a hook to fetch posts from the backend actor.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the authenticated or anonymous actor instance and refreshes dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context with login, logout, and stored identity restoration.",
  "frontend/src/index.css": "Tailwind CSS setup with theme variables for light and dark modes.",
  "frontend/src/main.tsx": "App entry point setting up QueryClient and InternetIdentityProvider.",
  "frontend/src/pages/admin/AdminLayout.tsx": "Admin layout that checks admin role, renders navigation tabs, header, and logout, and displays nested admin pages.",
  "frontend/src/pages/admin/PostsAdminPage.tsx": "Admin page to list, create, edit, and delete posts with image upload support via dialogs.",
  "frontend/src/pages/admin/VacanciesAdminPage.tsx": "Admin interface for managing job vacancies including creation, editing, deletion, and form handling.",
  "frontend/src/pages/dashboard/BrowseJobsPage.tsx": "Job browsing page with search functionality that lists vacancies and links to job details.",
  "frontend/src/pages/dashboard/DashboardLayout.tsx": "User dashboard layout that loads the profile, shows navigation tabs, and handles logout and onboarding redirect.",
  "frontend/src/pages/dashboard/JobDetailPage.tsx": "Job detail view allowing users to see vacancy info and submit applications with optional resume upload.",
  "frontend/src/pages/dashboard/MessagesPage.tsx": "Renders inbox and sent messages with tabs, and includes a form to send messages using hooks and Principal validation.",
  "frontend/src/pages/dashboard/MyApplicationsPage.tsx": "Displays the user's job applications with job details, status badges, and loading/empty states.",
  "frontend/src/pages/dashboard/ProfilePage.tsx": "Shows and edits the user's profile, including resume upload with progress and form submission via saveProfile.",
  "frontend/src/pages/dashboard/UpdatesPage.tsx": "Fetches and displays announcement posts with optional images and formatted dates.",
  "frontend/src/pages/LandingPage.tsx": "Landing page that triggers login and redirects users based on profile and role.",
  "frontend/src/pages/OnboardingPage.tsx": "Onboarding form to create a user profile and optionally upload a resume.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, and clearing URL and session parameters, including hash-based parsing.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, animations, container settings, and enabling plugins.",
  "project_state.json": "Defines the project’s state, schema version, and a list of existing features describing required UI, authentication, user profiles, dashboards, job listings, updates, and messaging functionality."
}