{
  "backend/main.mo": "Main Motoko canister defining storage, auth mixins, data types, and CRUD/query methods for profiles, jobs, applications, posts, and messages.",
  "feature_evidence.json": "JSON report describing a feature request to replace a static logo asset and its related components and test evidence.",
  "frontend-file-summaries.txt": "Prewritten summaries of multiple frontend files describing their roles in routing, pages, components, and hooks.",
  "frontend/index.css": "Tailwind base and theme variable definitions with light/dark mode CSS custom properties.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes for landing, onboarding, dashboard sections, and admin panel.",
  "frontend/src/components/admin/AdminPasswordGate.tsx": "Password gate component that validates admin password input and displays errors.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "UI screen shown when a non-admin user attempts to access admin-only areas.",
  "frontend/src/hooks/queries/useAdminMutations.ts": "React Query mutation hooks for admin CRUD actions on vacancies and posts with password-session handling.",
  "frontend/src/hooks/queries/useApplications.ts": "React Query hooks to fetch the caller’s applications and submit new job applications.",
  "frontend/src/hooks/queries/useAuthorizedUserSearch.ts": "Runs an authorized user search using the actor and admin password, locking on unauthorized errors.",
  "frontend/src/hooks/queries/useCallerRole.ts": "Fetches the current caller's user role from the backend actor.",
  "frontend/src/hooks/queries/useCallerUserProfile.ts": "Retrieves the caller's profile and provides a mutation to save profile updates.",
  "frontend/src/hooks/queries/useJobs.ts": "Provides queries to list, search, and fetch individual job vacancies from the actor.",
  "frontend/src/hooks/queries/useMessages.ts": "Fetches inbox and sent messages and offers a mutation to send new messages.",
  "frontend/src/hooks/queries/usePosts.ts": "Loads a list of posts from the backend actor.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on Internet Identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useAdminPassword.ts": "Manages an admin session password with sessionStorage persistence and lock/unlock handling.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity login state, identity loading, and auth client management.",
  "frontend/src/index.css": "Defines Tailwind base styles and CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/admin/AdminLayout.tsx": "Admin layout providing password-gated access, navigation tabs, and a content outlet.",
  "frontend/src/pages/admin/PostsAdminPage.tsx": "Admin interface to list, create, edit, and delete posts with image upload support.",
  "frontend/src/pages/admin/VacanciesAdminPage.tsx": "Admin page for managing job vacancies, including creation, editing, and deletion.",
  "frontend/src/pages/dashboard/BrowseJobsPage.tsx": "Displays searchable job listings with search controls and navigation to job details.",
  "frontend/src/pages/dashboard/DashboardLayout.tsx": "User dashboard layout handling authentication, profile loading, navigation tabs, and logout.",
  "frontend/src/pages/dashboard/JobDetailPage.tsx": "Shows detailed job info and allows users to apply with a cover letter and resume upload.",
  "frontend/src/pages/dashboard/MessagesPage.tsx": "Admin-focused messaging UI that lets admins search users, view inbox/sent messages, and send messages with validation and date formatting.",
  "frontend/src/pages/dashboard/MyApplicationsPage.tsx": "Displays the user's job applications with job details, status indicators, and formatted dates.",
  "frontend/src/pages/dashboard/ProfilePage.tsx": "User profile editor allowing updates to personal info and resume upload with progress tracking.",
  "frontend/src/pages/dashboard/UpdatesPage.tsx": "Renders posts and announcements with optional images and formatted creation dates.",
  "frontend/src/pages/LandingPage.tsx": "Landing page that handles login and redirects users based on profile and role.",
  "frontend/src/pages/OnboardingPage.tsx": "Onboarding form for creating the caller's profile with optional resume upload.",
  "frontend/src/utils/urlParams.ts": "Utility for reading, storing, and clearing URL or session-based parameters including hash routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata describing current features, logo replacement requirements, and configuration details."
}