{
  "backend/main.mo": "Motoko backend canister defining data types and CRUD logic for profiles, jobs, applications, posts, and messages with authorization and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report detailing recent admin error‑handling improvements and listing affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file, mainly pages, hooks, and components.",
  "frontend/.env": "Development environment file defining the logo asset URL.",
  "frontend/.env.production": "Production environment file defining the logo asset URL.",
  "frontend/index.css": "Global Tailwind CSS setup defining color variables, theming, and base styles for the app.",
  "frontend/index.html": "HTML entry point loading the React app and injecting the logo URL as favicon.",
  "frontend/src/App.tsx": "Sets up the full TanStack Router tree for landing, onboarding, dashboard, job pages, and admin routes.",
  "frontend/src/components/admin/AdminPasswordGate.tsx": "Admin password entry component showing logo, error messages, and calling onUnlock to verify admin access.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "UI screen shown to unauthorized users with logo, warning icon, and a button to return to the dashboard.",
  "frontend/src/components/branding/Logo.tsx": "Logo component rendering a circular image using the resolved LOGO_URL with size presets.",
  "frontend/src/hooks/queries/useAdminMutations.ts": "Provides React Query mutations for creating, updating, and deleting job vacancies and posts with admin error handling and cache invalidation.",
  "frontend/src/hooks/queries/useApplications.ts": "Defines queries for fetching user applications and a mutation for applying to jobs with cache updates.",
  "frontend/src/hooks/queries/useAuthorizedUserSearch.ts": "Performs an admin-protected user search with basic unauthorized error handling.",
  "frontend/src/hooks/queries/useCallerRole.ts": "Fetches the caller’s user role via a simple React Query hook.",
  "frontend/src/hooks/queries/useCallerUserProfile.ts": "Manages fetching and saving the caller’s user profile with cache invalidation.",
  "frontend/src/hooks/queries/useJobs.ts": "Provides queries for listing, searching, and fetching individual job vacancies.",
  "frontend/src/hooks/queries/useMessages.ts": "Implements inbox and sent‑messages queries plus a send‑message mutation with cache updates.",
  "frontend/src/hooks/queries/usePosts.ts": "Fetches all posts for display using React Query.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on identity, auto‑invalidating dependent queries on change.",
  "frontend/src/hooks/useAdminPassword.ts": "Tracks admin unlock state, validates admin privileges, and handles session locking and errors.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication, login handling, and identity persistence through context.",
  "frontend/src/index.css": "Global Tailwind CSS setup defining color variables, theming, and base styles.",
  "frontend/src/main.tsx": "Application entry point initializing React Query, identity provider, and rendering the root app.",
  "frontend/src/pages/admin/AdminLayout.tsx": "Admin layout with password gating, navigation tabs, and a container for admin subpages.",
  "frontend/src/pages/admin/PostsAdminPage.tsx": "Admin interface to list, create, edit, and delete posts with optional image uploads.",
  "frontend/src/pages/admin/VacanciesAdminPage.tsx": "Admin page for managing job vacancies including creating, editing, and deleting listings.",
  "frontend/src/pages/dashboard/BrowseJobsPage.tsx": "Job browsing page with search, job listing display, and navigation to job detail pages.",
  "frontend/src/pages/dashboard/DashboardLayout.tsx": "Dashboard shell that checks identity and profile, provides navigation tabs, and renders the layout with logout and user info.",
  "frontend/src/pages/dashboard/JobDetailPage.tsx": "Displays job details, handles file upload, and submits job applications with cover letter and resume.",
  "frontend/src/pages/dashboard/MessagesPage.tsx": "Shows inbox and sent messages, allows admins to search users and send messages.",
  "frontend/src/pages/dashboard/MyApplicationsPage.tsx": "Lists the user's job applications with status, dates, and resume links.",
  "frontend/src/pages/dashboard/ProfilePage.tsx": "User profile form enabling editing personal info and uploading a resume.",
  "frontend/src/pages/dashboard/UpdatesPage.tsx": "Displays announcement posts with dates, images, and content.",
  "frontend/src/pages/LandingPage.tsx": "Landing page that handles authentication redirects and displays marketing, contact info, and feature sections.",
  "frontend/src/pages/OnboardingPage.tsx": "User onboarding form that saves profile data and optionally uploads a resume.",
  "frontend/src/utils/adminErrorFormatting.ts": "Formats admin-related errors, detecting stopped-canister and authorization issues and returning structured user-friendly messages.",
  "frontend/src/utils/logoAsset.ts": "Provides a centralized logo URL with cache-busting, using an environment variable with a fallback.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and clearing URL and session parameters, supporting hash-based routing and persistence.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, color variables, animations, and plugins like typography and container queries.",
  "project_state.json": "Project state metadata describing features, known issues, and requirements related to handling stopped backend canister errors."
}