{
  "backend/main.mo": "Motoko canister implementing user profiles, jobs, applications, posts, messaging, and admin‑gated actions with storage and access control mixins.",
  "feature_evidence.json": "Feature evidence report listing implemented UI changes, affected files, components, and test IDs for share links, tappable phone numbers, and logo asset updates.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries of all frontend React/TypeScript files for reference or tooling.",
  "frontend/index.css": "Tailwind CSS base configuration defining theme variables and dark mode tokens for global styling.",
  "frontend/index.html": "Base HTML entry file loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router with routes for landing, onboarding, dashboard pages, and admin CMS.",
  "frontend/src/components/admin/AdminPasswordGate.tsx": "UI component providing a password form to unlock the admin panel with visual feedback on failure.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays an access‑denied message and button redirecting users back to the dashboard.",
  "frontend/src/hooks/queries/useAdminMutations.ts": "Defines React Query mutations for admin actions like creating, updating, and deleting job vacancies and posts with password checks and query invalidation.",
  "frontend/src/hooks/queries/useApplications.ts": "Provides hooks to fetch the user's job applications and submit new applications, invalidating queries on success.",
  "frontend/src/hooks/queries/useAuthorizedUserSearch.ts": "Implements an admin-protected user search query requiring a session password and handling unauthorized errors.",
  "frontend/src/hooks/queries/useCallerRole.ts": "Fetches the current caller's role from the backend when an actor is available.",
  "frontend/src/hooks/queries/useCallerUserProfile.ts": "Fetches and updates the current user's profile with React Query and keeps loading state synced with actor readiness.",
  "frontend/src/hooks/queries/useJobs.ts": "Provides queries for listing, searching, and fetching individual job vacancies based on the current actor.",
  "frontend/src/hooks/queries/useMessages.ts": "Defines inbox, sent messages, and send-message operations with cache invalidation after sending.",
  "frontend/src/hooks/queries/usePosts.ts": "Fetches all posts for display, depending on actor availability.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor using Internet Identity, auto-reinitializing and invalidating queries on identity changes.",
  "frontend/src/hooks/useAdminPassword.ts": "Manages a stored admin session password with unlock and lock helpers using sessionStorage.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context and login/logout logic using Dfinity AuthClient with identity persistence.",
  "frontend/src/index.css": "Defines Tailwind base styles and theme CSS variables for light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/admin/AdminLayout.tsx": "Provides the admin panel layout with password gating, navigation tabs, and a lock function.",
  "frontend/src/pages/admin/PostsAdminPage.tsx": "Allows admins to create, edit, and delete posts, including optional image uploads with progress tracking.",
  "frontend/src/pages/admin/VacanciesAdminPage.tsx": "Enables admins to manage job vacancies by creating, editing, and deleting listings via a dialog form.",
  "frontend/src/pages/dashboard/BrowseJobsPage.tsx": "Displays job listings with search functionality and navigates to job detail pages.",
  "frontend/src/pages/dashboard/DashboardLayout.tsx": "Defines the user dashboard layout, handling authentication, onboarding redirect, navigation tabs, and logout.",
  "frontend/src/pages/dashboard/JobDetailPage.tsx": "Displays job details and handles applying with cover letter and resume upload using progress tracking.",
  "frontend/src/pages/dashboard/MessagesPage.tsx": "Shows inbox and sent messages, with admin-only search and message sending functionality.",
  "frontend/src/pages/dashboard/MyApplicationsPage.tsx": "Lists the user's job applications with job info, dates, status badges, and resume links.",
  "frontend/src/pages/dashboard/ProfilePage.tsx": "Renders and updates the user's profile, allowing edits and optional resume upload with progress.",
  "frontend/src/pages/dashboard/UpdatesPage.tsx": "Displays announcement posts with optional images and formatted dates.",
  "frontend/src/pages/LandingPage.tsx": "Landing page that handles login redirects based on user profile and role, and displays marketing content.",
  "frontend/src/pages/OnboardingPage.tsx": "Renders a user onboarding form that saves profile data and optionally uploads a resume with progress tracking.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, and clearing URL and session parameters for navigation state.",
  "frontend/tailwind.config.js": "Tailwind config enabling dark mode, custom colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "JSON describing the project’s current state, required features, known deployment issues, and admin/auth changes needed."
}