{
  "kind": "build_request",
  "title": "Fix branding/social links and implement password-only admin access with name-based user search",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Replace the placeholder Facebook and WhatsApp share links with the exact user-provided destinations throughout the UI.\n- Facebook must open: https://www.facebook.com/profile.php?id=61575264476230\n- WhatsApp must open a chat to: 9804968758 (use a wa.me link that works in mobile/desktop)\nUpdate every place the app currently links to https://facebook.com and https://wa.me (e.g., Landing page footer and Dashboard share card/footer).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Facebook button that opens https://www.facebook.com/profile.php?id=61575264476230",
          "WhatsApp button that opens a WhatsApp chat to 9804968758"
        ]
      },
      "acceptanceCriteria": [
        "Clicking any Facebook icon/button in the app opens https://www.facebook.com/profile.php?id=61575264476230 in a new tab/window.",
        "Clicking any WhatsApp icon/button in the app opens a WhatsApp chat link for 9804968758 in a new tab/window.",
        "No remaining anchors in the UI still point to the placeholder https://facebook.com or https://wa.me."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Make the displayed phone number(s) tappable to open the device dialer.\n- Wherever the phone numbers are shown (Landing page contact strip, Dashboard header contact strip, Dashboard footer, Landing footer), render them as tel: links.\n- Ensure at least 9804968758 is tappable via tel:9804968758 (and apply the same behavior to the other displayed number as well).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Phone number that opens the phone dialer when tapped"
        ]
      },
      "acceptanceCriteria": [
        "On mobile, tapping the displayed phone number opens the dialer with the number prefilled.",
        "Phone numbers are rendered as accessible links (e.g., <a href=\"tel:...\">) without breaking the current layout/styling."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Ensure the provided logo is actually present as a static asset and used consistently in all existing header/hero/footer locations where the app currently references /assets/logo-job.jpg.\n- Add/replace the logo file at frontend/public/assets/logo-job.jpg so it is included in the deployed build.\n- Keep the existing <img src=\"/assets/logo-job.jpg\" ... /> usages working (Landing page hero, Landing footer, Dashboard header/footer, Admin header).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-15",
          "msg-1"
        ],
        "quotes": [
          "you didn't add logo",
          "Insert your uploaded logo into the header exactly as requested"
        ]
      },
      "acceptanceCriteria": [
        "The logo renders (not broken/missing) on the Landing page hero section.",
        "The logo renders on the Dashboard header and footer.",
        "The logo renders on the Admin header.",
        "The deployed build contains the logo at /assets/logo-job.jpg and the browser network panel shows it loading successfully (HTTP 200)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Change admin access to be password-only using the exact password \"@rewan10\" with no Internet Identity requirement, and lock the entire admin panel behind this password.\n- Add an admin password gate UX for /admin routes: if the correct password has not been entered in the current session, show a password prompt instead of the admin UI.\n- Store the unlocked state in session storage (or equivalent) so refreshes keep the admin unlocked for the current browser session.\n- Remove the current Internet Identity dependency for accessing AdminLayout (do not require identity to view /admin when the password gate is satisfied).\n- Keep all user-facing text in English.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2",
          "msg-15"
        ],
        "quotes": [
          "make sure the admin login just needs passsword \"@rewan10\" nothing else and the admin panal is only accessede after adding password"
        ]
      },
      "acceptanceCriteria": [
        "Visiting /admin without having entered the password shows only a password prompt and does not show vacancies/posts admin content.",
        "Entering \"@rewan10\" unlocks the admin panel and allows navigation between admin tabs.",
        "Entering a wrong password does not unlock the admin panel and shows an error message in English.",
        "Refreshing the page after unlocking keeps access for the current session (until the session storage is cleared or the browser session ends)."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Update the backend to support password-authorized admin operations (so admin CRUD works without Internet Identity).\n- Add password-guarded variants (or update existing methods) for admin-only operations used by the admin UI:\n  - createJobVacancy, updateJobVacancy, deleteJobVacancy\n  - createPost, updatePost, deletePost\n- The backend must validate the provided password exactly equals \"@rewan10\" and reject (trap) otherwise.\n- Keep backend in the existing single-actor file (backend/main.mo).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "admin login just needs passsword \"@rewan10\" nothing else"
        ]
      },
      "acceptanceCriteria": [
        "Admin CRUD calls succeed when the correct password \"@rewan10\" is provided.",
        "Admin CRUD calls fail (reject/trap) when an incorrect password is provided.",
        "Existing non-admin user flows (job browsing, applying, profile saving, viewing posts) continue to work as before."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Wire the admin frontend to use the password-authorized backend methods.\n- Update React Query admin mutation hooks (frontend/src/hooks/queries/useAdminMutations.ts) and any admin pages that call them to include the admin password when calling the backend.\n- Ensure the password is sourced from the same session-stored value used by the admin password gate.\n- If the backend rejects due to missing/invalid password, show a clear English error and return the user to the password prompt state.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-2",
          "msg-15"
        ],
        "quotes": [
          "the admin panal is only accessede after adding password"
        ]
      },
      "acceptanceCriteria": [
        "Creating/updating/deleting vacancies works from the admin UI after entering the password.",
        "Creating/updating/deleting posts works from the admin UI after entering the password.",
        "If the session password is cleared/invalid, admin actions fail gracefully and the UI prompts again for the password."
      ]
    },
    {
      "id": "REQ-7",
      "text": "Replace the admin-only Principal ID receiver input with a name-based person search and selection.\n- In the message compose area shown to admins, remove the freeform Principal ID field.\n- Provide a search input that filters people by name (first name + last name) and allows selecting a person; the selection determines the receiver principal.\n- The UI must display the selected person’s full name (and may optionally show a shortened principal for disambiguation).\n- Keep all user-facing text in English.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "replace that principal id search with Name of person search please"
        ]
      },
      "acceptanceCriteria": [
        "As an admin, the compose form no longer asks for a principal ID directly.",
        "As an admin, typing into the person search filters a list by first/last name and allows selecting a recipient.",
        "After selecting a person by name and sending, the message is sent to the correct principal.",
        "As a non-admin user, the compose form behavior remains unchanged (no recipient selection required)."
      ]
    },
    {
      "id": "REQ-8",
      "text": "Add backend support needed for name-based person search.\n- Implement a query method that returns a list of user profiles with their principals (e.g., [{ principal; firstName; lastName; email? }]).\n- Implement optional server-side filtering by a provided name search term (case-insensitive contains match on firstName/lastName/full name).\n- Ensure the method is only callable by an authorized admin path consistent with the new password-only admin model (i.e., require the admin password).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "replace that principal id search with Name of person search"
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes a query that can return principals + user names for populating the admin recipient picker.",
        "Query supports filtering by a name search term and returns only matching entries.",
        "Query rejects (trap) when called with an invalid password."
      ]
    }
  ],
  "constraints": [
    "Frontend files under frontend/src/hooks/useInternetIdentity.ts and frontend/src/hooks/useActor.ts (and other immutable paths listed in SYSTEM_CONTEXT) must not be edited; implement changes by modifying non-immutable components/pages/hooks.",
    "Backend must remain a single Motoko actor with logic in backend/main.mo; only add a migration file if a stable-state upgrade requires it.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Implementing third-party authentication providers (only Internet Identity is available, but admin must be password-only per request).",
    "Adding real-time messaging, push notifications, or external databases.",
    "Changing the overall visual theme beyond what is necessary to add the requested password gate/search UI."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}