{
  "kind": "spec_vs_diff_report",
  "version": "1.0",
  "generatedAt": "2026-02-07T11:00:22.089Z",
  "summary": "The diff adds a centralized admin error formatter that detects stopped-canister replica errors (IC0508 / Reject code 5 / “is stopped”) and wires it into the admin status check/unlock flow and multiple admin CRUD mutations. The stopped-canister case now shows a short English message including canister ID gkorp-uqaaa-aaaab-qeptq-cai and avoids leaving the UI stuck in the “Checking admin access...” loading state by ensuring the check completes and the session unlock flag is cleared.",
  "missing_requirements": [
    {
      "id": "REQ-2",
      "requirement": "Other existing authorization errors (e.g., \"Unauthorized\" / \"Only admins\") continue to display the existing access-denied guidance and continue to lock the admin session as currently implemented.",
      "reason": "The new centralized formatter replaces authorization-error messaging with a new generic string, but the diff does not show that it preserves the previously existing access-denied guidance text/behavior (it appears to overwrite it).",
      "evidence": [
        "frontend/src/utils/adminErrorFormatting.ts"
      ]
    }
  ],
  "hallucinated_features": [
    {
      "description": "Treating errors containing the substring \"trap\" as authorization errors in centralized admin error formatting.",
      "reason": "The BuildRequest only called out \"Unauthorized\" / \"Only admins\" as authorization error examples; adding \"trap\" as an authorization classifier is additional behavior not requested.",
      "evidence": [
        "frontend/src/utils/adminErrorFormatting.ts"
      ]
    }
  ],
  "confidence": 0.62,
  "changed_files": [
    "frontend-file-summaries.txt",
    "frontend/src/components/admin/AdminPasswordGate.tsx",
    "frontend/src/hooks/queries/useAdminMutations.ts",
    "frontend/src/hooks/useAdminPassword.ts",
    "frontend/src/pages/admin/AdminLayout.tsx",
    "frontend/src/utils/adminErrorFormatting.ts",
    "project_state.json"
  ]
}